PKS1C/src/Documents/ДоговорОбслуживания/ДоговорОбслуживания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДоговорОбслуживания</name>
  <registerRecords>InformationRegister.ДоговораОбслуживания</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>АбонентскаяПлата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТарифСверхурочный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧерныйСписок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

PKS1C/src/InformationRegisters/ДоговораОбслуживания/ДоговораОбслуживания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДоговораОбслуживания</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>АбонентскаяПлата</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифСверхурочный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЧерныйСписок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

PKS1C/src/Documents/ДоговорОбслуживания/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	1 КАК Запись
		|ИЗ
		|	РегистрСведений.ДоговораОбслуживания КАК ДоговорОбслуживания
		|ГДЕ
		|	ДоговорОбслуживания.Период МЕЖДУ &От И &До
		|	И ДоговорОбслуживания.Контрагент = &Контрагент";

	Запрос.УстановитьПараметр("От", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("До", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать(); 
	
	//Записи = 0;
	//
	//Пока Выборка.Следующий() Цикл
	//	Записи = Записи + 1;
	//КонецЦикла;
	
	Если Выборка.Следующий() Тогда
		Движения.ДоговораОбслуживания.Записывать = Ложь;
		Отказ = Истина;
		Сообщить("Договор с контрагентом " + Контрагент + "в этом месяце уже был заключен");
		Возврат;
	Иначе	
	
	// регистр ДоговораОбслуживания
	Движения.ДоговораОбслуживания.Записывать = Истина;
	Движение = Движения.ДоговораОбслуживания.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	//Движение.Дата = Дата;
	Движение.АбонентскаяПлата = АбонентскаяПлата;
	Движение.Тариф = Тариф;
	Движение.ТарифСверхурочный = ТарифСверхурочный;

	Движение.СрокДействия = СрокДействия;
	Движение.ЧерныйСписок = ЧерныйСписок;
	КонецЕсли;
КонецПроцедуры
